#### Terraform Format and Style 🖌``
#### Terraform Initialization ⚙️``
#### Terraform Validation 🤖``
#### Terraform Plan 📖``

<details><summary>Show Plan</summary>

```

terraform
Running plan in Terraform Cloud. Output will stream here. Pressing Ctrl-C
will stop streaming the logs, but will not stop the plan running remotely.

Preparing the remote plan...

The remote workspace is configured to work with configuration at
infrastructure/environments/staging relative to the target repository.

Terraform will upload the contents of the following directory,
excluding files or directories as defined by a .terraformignore file
at /home/runner/work/MovingCompanyAPI/MovingCompanyAPI/.terraformignore (if it is present),
in order to capture the filesystem context the remote workspace expects:
    /home/runner/work/MovingCompanyAPI/MovingCompanyAPI

To view this run in a browser, visit:
https://app.terraform.io/app/vaernion/moving-api-staging/runs/run-LfGm6GqhQAxjngfP

Waiting for the plan to start...

Terraform v1.2.3
on linux_amd64
Initializing plugins and modules...

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # module.moving.azurerm_app_service.app will be created
  + resource "azurerm_app_service" "app" {
      + app_service_plan_id               = (known after apply)
      + app_settings                      = (known after apply)
      + client_affinity_enabled           = false
      + client_cert_enabled               = false
      + client_cert_mode                  = (known after apply)
      + custom_domain_verification_id     = (known after apply)
      + default_site_hostname             = (known after apply)
      + enabled                           = true
      + https_only                        = false
      + id                                = (known after apply)
      + key_vault_reference_identity_id   = (known after apply)
      + location                          = "westeurope"
      + name                              = "staging-movingapi22-webapp-moving"
      + outbound_ip_address_list          = (known after apply)
      + outbound_ip_addresses             = (known after apply)
      + possible_outbound_ip_address_list = (known after apply)
      + possible_outbound_ip_addresses    = (known after apply)
      + resource_group_name               = "staging-movingapi22-rg-appservice-moving"
      + site_credential                   = (known after apply)

      + auth_settings {
          + additional_login_params        = (known after apply)
          + allowed_external_redirect_urls = (known after apply)
          + default_provider               = (known after apply)
          + enabled                        = (known after apply)
          + issuer                         = (known after apply)
          + runtime_version                = (known after apply)
          + token_refresh_extension_hours  = (known after apply)
          + token_store_enabled            = (known after apply)
          + unauthenticated_client_action  = (known after apply)

          + active_directory {
              + allowed_audiences = (known after apply)
              + client_id         = (known after apply)
              + client_secret     = (sensitive value)
            }

          + facebook {
              + app_id       = (known after apply)
              + app_secret   = (sensitive value)
              + oauth_scopes = (known after apply)
            }

          + google {
              + client_id     = (known after apply)
              + client_secret = (sensitive value)
              + oauth_scopes  = (known after apply)
            }

          + microsoft {
              + client_id     = (known after apply)
              + client_secret = (sensitive value)
              + oauth_scopes  = (known after apply)
            }

          + twitter {
              + consumer_key    = (known after apply)
              + consumer_secret = (sensitive value)
            }
        }

      + connection_string {
          + name  = (known after apply)
          + type  = (known after apply)
          + value = (sensitive value)
        }

      + logs {
          + detailed_error_messages_enabled = (known after apply)
          + failed_request_tracing_enabled  = (known after apply)

          + application_logs {
              + file_system_level = (known after apply)

              + azure_blob_storage {
                  + level             = (known after apply)
                  + retention_in_days = (known after apply)
                  + sas_url           = (sensitive value)
                }
            }

          + http_logs {
              + azure_blob_storage {
                  + retention_in_days = (known after apply)
                  + sas_url           = (sensitive value)
                }

              + file_system {
                  + retention_in_days = (known after apply)
                  + retention_in_mb   = (known after apply)
                }
            }
        }

      + site_config {
          + acr_use_managed_identity_credentials = (known after apply)
          + acr_user_managed_identity_client_id  = (known after apply)
          + always_on                            = (known after apply)
          + app_command_line                     = (known after apply)
          + auto_swap_slot_name                  = (known after apply)
          + default_documents                    = (known after apply)
          + dotnet_framework_version             = (known after apply)
          + ftps_state                           = (known after apply)
          + health_check_path                    = (known after apply)
          + http2_enabled                        = (known after apply)
          + ip_restriction                       = (known after apply)
          + java_container                       = (known after apply)
          + java_container_version               = (known after apply)
          + java_version                         = (known after apply)
          + linux_fx_version                     = (known after apply)
          + local_mysql_enabled                  = (known after apply)
          + managed_pipeline_mode                = (known after apply)
          + min_tls_version                      = (known after apply)
          + number_of_workers                    = (known after apply)
          + php_version                          = (known after apply)
          + python_version                       = (known after apply)
          + remote_debugging_enabled             = (known after apply)
          + remote_debugging_version             = (known after apply)
          + scm_ip_restriction                   = (known after apply)
          + scm_type                             = (known after apply)
          + scm_use_main_ip_restriction          = (known after apply)
          + use_32_bit_worker_process            = (known after apply)
          + vnet_route_all_enabled               = (known after apply)
          + websockets_enabled                   = (known after apply)
          + windows_fx_version                   = (known after apply)

          + cors {
              + allowed_origins     = (known after apply)
              + support_credentials = (known after apply)
            }
        }

      + source_control {
          + branch             = "main"
          + manual_integration = true
          + repo_url           = "https://github.com/vaernion/MovingCompanyAPI"
          + rollback_enabled   = (known after apply)
          + use_mercurial      = false
        }

      + storage_account {
          + access_key   = (sensitive value)
          + account_name = (known after apply)
          + mount_path   = (known after apply)
          + name         = (known after apply)
          + share_name   = (known after apply)
          + type         = (known after apply)
        }
    }

  # module.moving.azurerm_app_service_plan.asp will be created
  + resource "azurerm_app_service_plan" "asp" {
      + id                           = (known after apply)
      + kind                         = "Windows"
      + location                     = "westeurope"
      + maximum_elastic_worker_count = (known after apply)
      + maximum_number_of_workers    = (known after apply)
      + name                         = "staging-movingapi22-asp-moving"
      + resource_group_name          = "staging-movingapi22-rg-appservice-moving"

      + sku {
          + capacity = (known after apply)
          + size     = "F1"
          + tier     = "Free"
        }
    }

  # module.moving.azurerm_resource_group.rg will be created
  + resource "azurerm_resource_group" "rg" {
      + id       = (known after apply)
      + location = "westeurope"
      + name     = "staging-movingapi22-rg-appservice-moving"
      + tags     = {
          + "environment" = "staging"
        }
    }

Plan: 3 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  + webapp_url = (known after apply)
╷
│ Warning: Deprecated Resource
│ 
│   with module.moving.azurerm_app_service_plan.asp,
│   on ../../modules/app-service/app-service.tf line 6, in resource "azurerm_app_service_plan" "asp":
│    6: resource "azurerm_app_service_plan" "asp" {
│ 
│ The `azurerm_app_service_plan` resource has been superseded by the
│ `azurerm_service_plan` resource. Whilst this resource will continue to be
│ available in the 2.x and 3.x releases it is feature-frozen for
│ compatibility purposes, will no longer receive any updates and will be
│ removed in a future major release of the Azure Provider.
│ 
│ (and 3 more similar warnings elsewhere)
╵

```

</details>

*Pushed by: @vaernion, Action: `pull_request`*